---
type: FamilySymbol
namespace: Autodesk.Revit.DB
version: 2024
members: 12
tags: [revit-api, class]
---

# FamilySymbol

`Autodesk.Revit.DB.FamilySymbol` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Activate | 2014 | `public void Activate ()` |
| Method | CanHaveStructuralSection | 2016 | `public bool CanHaveStructuralSection ()` |
| Method | GetFamilyPointLocations | 2011 | `public IList < FamilyPointLocation > GetFamilyPointLocations ()` |
| Method | GetStructuralSection | 2015 | `public StructuralSection GetStructuralSection ()` |
| Method | GetThermalProperties | 2013 | `public FamilyThermalProperties GetThermalProperties ()` |
| Method | HasThermalProperties | 2015 | `public bool HasThermalProperties ()` |
| Method | SetStructuralSection | 2015 | `public void SetStructuralSection ( StructuralSection structuralSection )` |
| Method | SetThermalProperties | 2013 | `public void SetThermalProperties ( FamilyThermalProperties thermalProperties )` |
| Property | Family | — | `public Family Family { get ; }` |
| Property | IsActive | 2014 | `public bool IsActive { get ; }` |
| Property | Parameter | — | `` |
| Property | StructuralMaterialType | — | `public StructuralMaterialType StructuralMaterialType { get ; }` |